In [1]:
import numpy as np

In [6]:
import pandas as pd

In [7]:
from numpy.random import randn

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [10]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [3]:
pd.Series([1,2,3,4], ['one','two','three','four'])

one      1
two      2
three    3
four     4
dtype: int64

# Dataframes

In [10]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [11]:
df

          W         X         Y         Z
A -1.050895  1.887856  0.914776 -0.074614
B -1.503319 -2.294394 -0.573870  0.452225
C -1.125872  0.581822  1.463799  0.322095
D -2.232335  1.262174 -1.572053  0.781147
E  0.535196 -1.457293 -0.980788  1.039613

In [12]:
df['W']

A   -1.050895
B   -1.503319
C   -1.125872
D   -2.232335
E    0.535196
Name: W, dtype: float64

In [13]:
df

          W         X         Y         Z
A -1.050895  1.887856  0.914776 -0.074614
B -1.503319 -2.294394 -0.573870  0.452225
C -1.125872  0.581822  1.463799  0.322095
D -2.232335  1.262174 -1.572053  0.781147
E  0.535196 -1.457293 -0.980788  1.039613

In [15]:
df['new'] = df['W'] + df['Y']

In [16]:
df

          W         X         Y         Z       new
A -1.050895  1.887856  0.914776 -0.074614 -0.136119
B -1.503319 -2.294394 -0.573870  0.452225 -2.077189
C -1.125872  0.581822  1.463799  0.322095  0.337927
D -2.232335  1.262174 -1.572053  0.781147 -3.804388
E  0.535196 -1.457293 -0.980788  1.039613 -0.445592

In [21]:
df.drop('new', axis=1, inplace=True)

In [22]:
df

          W         X         Y         Z
A -1.050895  1.887856  0.914776 -0.074614
B -1.503319 -2.294394 -0.573870  0.452225
C -1.125872  0.581822  1.463799  0.322095
D -2.232335  1.262174 -1.572053  0.781147
E  0.535196 -1.457293 -0.980788  1.039613